"""Сообщение в виде битовой карты, (c) Эл Свейгарт al@inventwithpython.com
Отображает текстовое сообщение в соответствии с указанной битовой картой.
Код размещен на https://nostarch.com/big-book-small-python-projects
Теги: крошечная, для начинающих, графика"""

import sys

bitmap = """
....................................................................
***********     *******************   *************
***********     *****************     *************
***********     ***************       *************
***********     *************         *************
***********     ***********           *************
***********     *********             *************
*****           *******               ******
*****           *****                 ******
*****           ***                   ******
...................................................................."""

print('Bitmap Message, by Al Sweigart al@inventwithpython.com')
print('Enter the message to display with the bitmap.')
message = input('> ')
if message == '':
    sys.exit()
    
# проходим в цикле по всем строкам битовой карты
for line in bitmap.splitlines():
    # проходим в цикле по всем символам строки
    for i, bit in enumerate(line):
        if bit == ' ':
            # вводим пустое пространство согласно пробелу в битовой карте
            print(' ', end='')
        else:
            # выводим символ сообщения
            print(message[i % len(message)], end='')
    print() # выводим символ новой строки